; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared1 - mode
	infrared3 - mode
	thermograph2 - mode
	thermograph0 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	Star8 - direction
	Star9 - direction
	Star5 - direction
	Star3 - direction
	GroundStation0 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(pointing satellite0 Star9)
	(pointing satellite1 Star9)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 thermograph2)
	(have_image Star13 thermograph2)
	(have_image Planet14 infrared1)
	(have_image Planet15 infrared1)
))

)

; plan
1. (turn_to satellite1 star9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star9)
   goals met: 1 of 7
2. (turn_to satellite0 groundstation7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation7)
   goals met: 1 of 7
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
4. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 1 of 7
5. (turn_to satellite0 planet14 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet14)
   goals met: 1 of 7
6. (take_image satellite0 planet14 instrument0 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 2 of 7
7. (turn_to satellite0 phenomenon11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon11 instrument0 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 3 of 7
9. (turn_to satellite0 planet15 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet15)
   goals met: 3 of 7
10. (take_image satellite0 planet15 instrument0 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 4 of 7
11. (turn_to satellite0 star12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star12)
   goals met: 4 of 7
12. (take_image satellite0 star12 instrument0 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 5 of 7
13. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 5 of 7
14. (take_image satellite0 star13 instrument0 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 6 of 7
15. (turn_to satellite0 star9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star9)
   goals met: 7 of 7
